<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;


class InvestmentsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('investments')->insert([
            [
                'name' => 'أراضي',
                'image' => 'assets\images\investments\land.jpg',
                'description' => 'الموقع:
أرض مساحتها 5000 متر مربع تقع في ضواحي مدينة (الرمثا)، .

الاستخدام المحتمل والفرص:
الأرض تصلح لتطوير مشروع سكني متعدد الطوابق يحتوي على 50 وحدة سكنية. كما يمكن استخدامها لإنشاء مرافق تجارية أو ترفيهية مثل مركز تسوق أو ملعب رياضي.

الميزات البيئية والطبيعية:
تتمتع الأرض بإطلالات جميلة على المناظر الطبيعية المحيطة. كما أنها موجودة في منطقة هادئة وآمنة تصلح للسكن.

البنية التحتية والخدمات:
توفر الأرض وصولًا سهلاً إلى الشوارع الرئيسية وتحيط بها جميع الخدمات الأساسية مثل الكهرباء والمياه وشبكات الصرف الصحي.

التفاصيل القانونية والتراخيص:
تملك الأرض جميع التصاريح اللازمة للبناء والاستخدام السكني/التجاري، وجميع الأوراق القانونية جاهزة للاستعراض.

التحليل المالي:
يتوفر تقييم مالي يشير إلى الاستثمار المتوقع والعائد المحتمل على الأرض مع إمكانية تقديمه للمهتمين.',


            ],
            [
                'name' => 'عقارات',
                'image' => 'assets\images\investments\realestate.png',
                'description' => 'العقار:
عقار تجاري مساحته 1000 متر مربع يقع في وسط المدينة بمنطقة الأعمال الرئيسية.

الموقع:
يتمتع العقار بموقع استراتيجي، حيث يقع في قلب المدينة وعلى بُعد دقائق من الشارع الرئيسي ومراكز التسوق الكبرى.

الاستخدام المحتمل:
يصلح العقار لتطوير مبنى متعدد الاستخدامات، يمكن استخدامه لمكاتب تجارية، معارض أو مطاعم ومقاهي.

الميزات البيئية والطبيعية:
عقار حديث البناء، مجهز بأحدث التقنيات الصديقة للبيئة مما يوفر كفاءة في استهلاك الطاقة.

البنية التحتية والخدمات:
يتوفر العقار على كافة الخدمات الأساسية مثل الكهرباء، وشبكات الاتصالات، ونظام الأمن على مدار الساعة.

التفاصيل القانونية والتراخيص:
جميع التراخيص اللازمة للاستخدام التجاري متوفرة، ويتمتع العقار بالامتيازات الضريبية المحلية.

التحليل المالي:
توجد دراسة جدوى تظهر العائد المالي المتوقع مع إمكانية تقديمها للمستثمرين المهتمين.

',


            ],
            [
                'name' => 'مخازن',
                'image' => 'assets\images\investments\inventory.jpg',
                'description' => 'المخازن:
مجمع مخازن تجارية حديثة المنشأ تشمل 10 مخازن بمساحة إجمالية تبلغ 5000 متر مربع.

الموقع:
المجمع يقع في منطقة صناعية حيوية على مشارف المدينة، وعلى بُعد 30 دقيقة من الميناء الرئيسي و20 دقيقة من المطار.

الاستخدام المحتمل:
المخازن ملائمة للاستخدامات التجارية والتخزينية المتعددة مثل التوزيع، وتخزين البضائع، والإنتاج الصناعي الخفيف.

الميزات البيئية والطبيعية:
تتمتع المخازن بتصميم مستدام وفعال من حيث استهلاك الطاقة وتوفير البيئة العمل المناسبة لتخزين البضائع.

البنية التحتية والخدمات:
كل مخزن مزود بأنظمة الأمان والسلامة، ونظام مراقبة عن بُعد، ومساحات للشاحنات والتحميل والتفريغ.

التفاصيل القانونية والتراخيص:
تملك المخازن جميع التراخيص والموافقات اللازمة للاستخدامات التجارية والتخزينية.

التحليل المالي:
تقديم تحليل مالي يوضح الاستثمار المتوقع وعائدات التأجير المحتملة.',


            ],
        ]);
    }
}
