<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class MunicipalityInfoSeeder extends Seeder
{

    public function run()
    {
        DB::table('municipality_infos')->insert([
            [
                'logo' => 'assets\images\loader.jpg',
                'description' => 'بلدية الرمثا الكبرى بلدية مركزها لواء الرمثا، تقع في محافظة إربد شمال الأردن، كما وتشكل لواء الرمثا، إلى جانب بلدية سهل حوران التي تضم مدينة الطرة والشجرة.
الرّمثا -  مدينة تقع في شمال الأردن ومركز اللواء وتقع بالقرب من الحدود السورية الأردنية . عدد سكان الرمثا يقدر بحوالي 263,680 ألف نسمة.
أصل التسمية : الرّمثا مأخوذة من الرمث وهو نبات ينبت في الرمثا.
بلدية الرمثا الكبرى واحدة من اهم واقدم البلديات في المملكة، وتتمثل رسالة البلدية في استمرار المساهمة في تطوير المجتمع المحلي ورفع مستوى معيشته من خلال خلق مناخ سليم  وصحي وتوفير الحد الأدنى من متطلبات الحياة
مستغلة كل الامكانيات لتحقيق حياه أفضل للمواطن ويقوم مجلس بلدية الرمثا الكبرى بتقديم الخدمات الأساسية لسكان المدينة ومن ابرز هذه الخدمات (النفايات، وصيانة وتعبيد الشوارع، وإنارة الشوارع، وتنظيم عمليات البناء وترخيصها، وإصدار رخص المهن والصناعات) بالاضافة الى الخدمات الالكترونية الجديدة',
                'description_image' => 'assets\images\loader.jpg',
                'vision' => 'بلدية متميزة على مستوى المملكه في المجال الخدمي والتنموي لمدينه
متكامله ومتطورة تتماشى مع طبيعتها وتحاكي تراثها',
                'mission' => 'المساهمة في تحقيق مستوى عالٍ من الرفاهية المجتمعية وذلك من خلال تقديم خدمات
بلدية رائدة ومميزة من جميع النواحي إلى مختلف القطاعات والمؤسسات العاملة من خلال تطبيق مبادىءالحاكمية الرشيدة، والتطوير التنموي لخلق فرص العمل. ',
                'email' => 'ramtha@gmail.com',
                'phone' => '+962 7 8608 8830',
            ]
        ]);
    }
}
