<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PollTopicSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('poll_topics')->insert([
            [
                'title' => 'إقامة دوار قرب مثلث الكتاب في الرمثا',
                'status' => 'on',
                'image' => 'http://127.0.0.1:8000/uploads/pollTopics-Seeder/poll1.jpg',
                'end_date' => '2024-12-31',
                'description' => 'تثير فكرة إنشاء دوار في مكان محيط مثلث الكتاب بالقرب من مستشفى الرمثا جدلاً واسعاً في المجتمع المحلي. يطرح هذا الموضوع تساؤلات حول الضرورة الملحة لتطوير حركة المرور في تلك المنطقة، وذلك بهدف تحسين الوصول إلى المستشفى وتسهيل حركة المرور للمرضى والزوار. من جهة أخرى، يثير الاقتراح تساؤلات حول التأثير المحتمل على البيئة المحيطة ومستوى الازدحام المروري. يُطلب من المجتمع المحلي المشاركة في هذا الاستطلاع للتعبير عن آرائهم بشأن إقامة الدوار والتأثيرات المتوقعة. الجمع بين الاحتياجات العامة وتطلعات السكان يشكل تحديًا هامًا في تطوير المشروعات الحضرية.',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'title' => 'تقييم أداء بلدية الرمثا في النظافة العامة',
                'status' => 'on',
                'image' => 'http://127.0.0.1:8000/uploads/pollTopics-Seeder/poll2.jpg',
                'end_date' => '2024-12-31',
                'description' => 'يتساءل السكان والمجتمع المحلي في الرمثا عن أداء بلدية المدينة في مجال النظافة العامة. يعد هذا الموضوع محل اهتمام كبير، حيث يتأثر راحة المواطنين وصورة المدينة بشكل مباشر بالجهود المبذولة للحفاظ على نظافتها. في هذا السياق، يستكشف هذا البحث مدى رضا المجتمع عن خدمات النظافة التي تقدمها البلدية، مع التركيز على جودة جمع القمامة، وصيانة الشوارع والمناطق العامة. يدعو البحث المجتمع المحلي إلى التعبير عن آرائهم وتجاربهم في هذا السياق، وذلك من خلال استبيان أو حضور جلسات نقاشية.',
                'created_at' => now(),
                'updated_at' => now(),
            ],
        ]);
    }
}
