<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class President extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('presidents')->insert([
            [
                'name' => 'أحمد الخزعلي',
                'image' => 'assets\images\president\president_image.jpg',
                'speech' => 'والصلاة والسلام على سيدنا محمد اشرف المرسلين وعلى اله وصحبة اجمعين
انه لشرف عظيم ان اكون رئيس للبلدية بعد ان حملني هذه الامانة اهلي في مدينة الرمثا 


قال تعالى
( ان عرضنا الامانة على السموات والارض والجبال فأبين ان يحملنها و أشفقنا منها و حملها الأنسان انه كان ظلوما جهولا ) صدق الله العظيم

تحية طيبة وبعد انه من فضل الله علي ان احمل الامانة للسير في جعل بلديتكم انموذجا في الرقي والازدهار وانه من دواعي سروري انكم تقفون دائما بجانبي من اجل تحقيق
الافضل لمدينتنا وبناءا على توجيهات جلالة الملك عبدلله الثاني حفظة الله ورعاة فأننا في بلدية الرمثا قمنا بأعداد خطة استراتيجية وتنموية عملية للأعوام من 2023 لغاية 2025
لرسم السياسات التنموية للبلدية بما يتلائم مع واقع هذه المدينة لموقعها الجغرافي وبما تتميز به من طبيعة اقتصادية وزراعية وتنموية وجعل هذه الخطة خطة مرنة تسهم في توفير بيئية ناجحة وملائمة للاستثمارات التي توفر خدمات لأبناء المجتمع المحلي من قاطنين ولاجئين وللخروج بمشاريع تعمل على تحسين الواقع الخدمي والتنموي لتتمكن البلدية من القيام بدورها من خلال التشاركية مع كافة ابناء المجتمع المحلي من نساء وشباب وكافة اطياف المجتمع الحبيب.
',
            ],
        ]);
    }
}
